Related: IMAP, mail, SMTP

POP4.org >>POP 4 is a specification for a few extensions to the POP 3 internet email protocol that gives much greater flexibility to email client programs without adding a heavy burden to the POP server. 


FreeSoft.org/CIE/RFC/1725/8.htm
"'Minimal POP3 Commands:

      USER name               valid in the AUTHORIZATION state
      PASS string
      QUIT

      STAT                    valid in the TRANSACTION state
      LIST [msg]
      RETR msg
      DELE msg
      NOOP
      RSET

      QUIT                    valid in the UPDATE state

   Optional POP3 Commands:

      APOP name digest        valid in the AUTHORIZATION state

      TOP msg n               valid in the TRANSACTION state
      UIDL [msg]

   POP3 Replies:

      +OK
      -ERR

Note that with the exception of the STAT, LIST, and UIDL commands, the reply given by the POP3 server to any command is significant only to "+OK" and "-ERR". Any text occurring after this reply may be ignored by the client.'"




FreeSoft.org/CIE/RFC/1725/9.htm
"'
9. Example POP3 Session
 <open connection>
   S:    +OK POP3 server ready <1896.697170952@dbc.mtview.ca.us>
   C:    APOP mrose c4c9334bac560ecc979e58001b3e22fb
   S:    +OK mrose's maildrop has 2 messages (320 octets)
   C:    STAT
   S:    +OK 2 320
   C:    LIST
   S:    +OK 2 messages (320 octets)
   S:    1 120
   S:    2 200
   S:    .
   C:    RETR 1
   S:    +OK 120 octets
   S:    <the POP3 server sends message 1>
   S:    .
   C:    DELE 1
   S:    +OK message 1 deleted
   C:    RETR 2
   S:    +OK 200 octets
   S:    <the POP3 server sends message 2>
   S:    .
   C:    DELE 2
   S:    +OK message 2 deleted
   C:    QUIT
   S:    +OK dewey POP3 server signing off (maildrop empty)
   C:  <close connection>
'"
